<a href="https://colab.research.google.com/github/birusolankar/Pyspark-Bigdata/blob/main/pyspark_29_12_2023.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
pip install pyspark

Collecting pyspark
  Downloading pyspark-3.5.0.tar.gz (316.9 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 316.9/316.9 MB 4.3 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.5.0-py2.py3-none-any.whl size=317425345 sha256=b5b128456771e4f44630b9605a3d543e63999b50001b75db95265e9dcb5149a8
  Stored in directory: /root/.cache/pip/wheels/41/4e/10/c2cf2467f71c678cfc8a6b9ac9241e5e44a01940da8fbb17fc
Successfully built pyspark
Installing collected packages: pyspark
Successfully installed pyspark-3.5.0

In [ ]:
from pyspark.sql import SparkSession

In [ ]:
spark = SparkSession.builder.appName("29/12/2023").getOrCreate()

In [ ]:
df = spark.read.csv("/content/Tutorial_2.csv", inferSchema = True, header=True)

In [ ]:
df.show()

+---------+---+----------+
|     Name|Age|Experience|
+---------+---+----------+
|     Amit| 22|       1.5|
|    Ankit| 25|       2.0|
|   Ashish| 18|       1.0|
|    Vijay| 29|       3.0|
|Sudarshan| 35|       5.0|
|    Ketan| 33|       7.0|
+---------+---+----------+

In [ ]:
tut4 = spark.read.csv("/content/Tutorial_4.csv", header = True, inferSchema = True)

In [ ]:
tut4.show()

+------+----------------+------+----------+
|  Name|      Department|Salary|Experience|
+------+----------------+------+----------+
|  Amit|    Data Science| 25000|         5|
|Mahesh|        Big Data| 17000|         7|
|Ramesh|        Big Data| 17000|         2|
|Sudhir|             IOT| 12000|         1|
|Sudhir|        Big Data|  7000|         4|
| Sunny|    Data Science| 20000|         2|
| Sunny|        Big Data| 12000|         3|
|  Alka|Machine Learning| 30000|         4|
+------+----------------+------+----------+

In [ ]:
df = spark.read.csv("/content/Tutorial_3.csv", header = True, inferSchema = True)

In [ ]:
df.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     NULL|NULL|      NULL|  NULL|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

In [ ]:
df.select(df['Age'].isNotNull()).show()

+-----------------+
|(Age IS NOT NULL)|
+-----------------+
|             true|
|             true|
|             true|
|            false|
|             true|
|            false|
|             true|
|             true|
|             true|
|            false|
|             true|
|             true|
+-----------------+

In [ ]:
df.na.drop(subset = 'Age').show()

+-----+---+----------+------+
| Name|Age|Experience|Salary|
+-----+---+----------+------+
| Amit| 22|       1.5| 12000|
| Amit| 22|       1.5| 12000|
|Ankit| 25|      NULL|  NULL|
|Vijay| 29|      NULL| 17000|
|Ketan| 33|      NULL| 23000|
| NULL| 36|       8.0|  NULL|
| NULL| 41|      NULL| 34000|
| Ajit| 43|      10.0| 40000|
| Ajit| 43|      10.0| 40000|
+-----+---+----------+------+

In [ ]:
df.na.drop(thresh = 3).show()

+------+----+----------+------+
|  Name| Age|Experience|Salary|
+------+----+----------+------+
|  Amit|  22|       1.5| 12000|
|  Amit|  22|       1.5| 12000|
|Ashish|NULL|       1.0| 15000|
| Vijay|  29|      NULL| 17000|
| Ketan|  33|      NULL| 23000|
|  Ajit|  43|      10.0| 40000|
|  Ajit|  43|      10.0| 40000|
+------+----+----------+------+

In [ ]:
df.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|     NULL|  36|       8.0|  NULL|
|     NULL|  41|      NULL| 34000|
|     NULL|NULL|      NULL|  NULL|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

In [ ]:
df.na.fill(25, subset = 'Age').show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|     Amit| 22|       1.5| 12000|
|     Amit| 22|       1.5| 12000|
|    Ankit| 25|      NULL|  NULL|
|   Ashish| 25|       1.0| 15000|
|    Vijay| 29|      NULL| 17000|
|Sudarshan| 25|       5.0|  NULL|
|    Ketan| 33|      NULL| 23000|
|     NULL| 36|       8.0|  NULL|
|     NULL| 41|      NULL| 34000|
|     NULL| 25|      NULL|  NULL|
|     Ajit| 43|      10.0| 40000|
|     Ajit| 43|      10.0| 40000|
+---------+---+----------+------+

In [ ]:
df.na.fill('James', subset = 'Name').show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|     Amit|  22|       1.5| 12000|
|     Amit|  22|       1.5| 12000|
|    Ankit|  25|      NULL|  NULL|
|   Ashish|NULL|       1.0| 15000|
|    Vijay|  29|      NULL| 17000|
|Sudarshan|NULL|       5.0|  NULL|
|    Ketan|  33|      NULL| 23000|
|    James|  36|       8.0|  NULL|
|    James|  41|      NULL| 34000|
|    James|NULL|      NULL|  NULL|
|     Ajit|  43|      10.0| 40000|
|     Ajit|  43|      10.0| 40000|
+---------+----+----------+------+

In [ ]:
# filling null values in more than one column simultaneously
df.na.fill({
    'Age':25,
    'Name':'james'
}).show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|     Amit| 22|       1.5| 12000|
|     Amit| 22|       1.5| 12000|
|    Ankit| 25|      NULL|  NULL|
|   Ashish| 25|       1.0| 15000|
|    Vijay| 29|      NULL| 17000|
|Sudarshan| 25|       5.0|  NULL|
|    Ketan| 33|      NULL| 23000|
|    james| 36|       8.0|  NULL|
|    james| 41|      NULL| 34000|
|    james| 25|      NULL|  NULL|
|     Ajit| 43|      10.0| 40000|
|     Ajit| 43|      10.0| 40000|
+---------+---+----------+------+

In [ ]:
dept = spark.read.csv("/content/department.csv", inferSchema= True, header = True)

In [ ]:
dept.show()

+------+--------+
|dpt_id|dpt_name|
+------+--------+
|     1|      IT|
|     2|   Sales|
|     3|      HR|
+------+--------+

In [ ]:
emp = spark.read.csv("/content/employee.csv", header = True, inferSchema = True)

In [ ]:
emp.show()

+------+--------+----------+------+
|emp_id|emp_name|emp_salary|dpt_id|
+------+--------+----------+------+
|     1|     Tom|       100|     1|
|     2|   Jenny|       150|     1|
|     3|  Andrew|        50|     2|
|     4| Michael|       120|     2|
|     5|  Jasmin|        50|     4|
|     6|    Bill|       200|     4|
+------+--------+----------+------+

In [ ]:
emp.join(dept, how='left', on = 'dpt_id').show()

+------+------+--------+----------+--------+
|dpt_id|emp_id|emp_name|emp_salary|dpt_name|
+------+------+--------+----------+--------+
|     1|     1|     Tom|       100|      IT|
|     1|     2|   Jenny|       150|      IT|
|     2|     3|  Andrew|        50|   Sales|
|     2|     4| Michael|       120|   Sales|
|     4|     5|  Jasmin|        50|    NULL|
|     4|     6|    Bill|       200|    NULL|
+------+------+--------+----------+--------+

In [ ]:
emp.join(dept, how = 'inner', on='dpt_id').groupBy('dpt_name').sum('emp_salary').show()

+--------+---------------+
|dpt_name|sum(emp_salary)|
+--------+---------------+
|   Sales|            170|
|      IT|            250|
+--------+---------------+

In [ ]:
ipl = spark.read.csv("/content/deliveries.csv", header = True, inferSchema = True)

In [ ]:
ipl.show(5)

+--------+------+-------------------+--------------------+----+----+---------+-----------+--------+-------------+---------+--------+-----------+-----------+------------+------------+----------+----------+----------------+--------------+-------+
|match_id|inning|       batting_team|        bowling_team|over|ball|  batsman|non_striker|  bowler|is_super_over|wide_runs|bye_runs|legbye_runs|noball_runs|penalty_runs|batsman_runs|extra_runs|total_runs|player_dismissed|dismissal_kind|fielder|
+--------+------+-------------------+--------------------+----+----+---------+-----------+--------+-------------+---------+--------+-----------+-----------+------------+------------+----------+----------+----------------+--------------+-------+
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   1|DA Warner|   S Dhawan|TS Mills|            0|        0|       0|          0|          0|           0|           0|         0|         0|            NULL|          NULL|   NULL|
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   2|DA Warner|   S Dhawan|TS Mills|            0|        0|       0|          0|          0|           0|           0|         0|         0|            NULL|          NULL|   NULL|
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   3|DA Warner|   S Dhawan|TS Mills|            0|        0|       0|          0|          0|           0|           4|         0|         4|            NULL|          NULL|   NULL|
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   4|DA Warner|   S Dhawan|TS Mills|            0|        0|       0|          0|          0|           0|           0|         0|         0|            NULL|          NULL|   NULL|
|       1|     1|Sunrisers Hyderabad|Royal Challengers...|   1|   5|DA Warner|   S Dhawan|TS Mills|            0|        2|       0|          0|          0|           0|           0|         2|         2|            NULL|          NULL|   NULL|
+--------+------+-------------------+--------------------+----+----+---------+-----------+--------+-------------+---------+--------+-----------+-----------+------------+------------+----------+----------+----------------+--------------+-------+
only showing top 5 rows

In [ ]:
ipl.groupBy('Batting_team').sum('total_runs').orderBy('sum(total_runs)', ascending = False).show()

+--------------------+---------------+
|        Batting_team|sum(total_runs)|
+--------------------+---------------+
|      Mumbai Indians|          29809|
|Royal Challengers...|          28126|
|     Kings XI Punjab|          27893|
|Kolkata Knight Ri...|          27419|
| Chennai Super Kings|          26418|
|    Delhi Daredevils|          24388|
|    Rajasthan Royals|          22431|
| Sunrisers Hyderabad|          17059|
|     Deccan Chargers|          11463|
|       Pune Warriors|           6358|
|       Gujarat Lions|           4862|
|      Delhi Capitals|           2630|
|Rising Pune Super...|           2470|
|Rising Pune Super...|           2063|
|Kochi Tuskers Kerala|           1901|
+--------------------+---------------+